Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored.AddVertices(System.Collections.Generic.IList{Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored})
Inserts multiple Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored instances into the stream and associated buffer.
vertices:
The vertices to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored.AddVertex(Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored)
Inserts a Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored into the stream and associated buffer.
vertex:
The vertex to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
A stream that can be used to write vertices of type Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored
into a buffer (see Autodesk.Revit.DB.DirectContext3D.VertexBuffer).
Since:
2017